---
kind: method
id: M:Autodesk.Revit.DB.RevisionNumberingSequence.HasValidRevisionSettingsForNumberType
source: html/e9934563-b89b-3e28-f83d-9a029578aa26.htm
---
# Autodesk.Revit.DB.RevisionNumberingSequence.HasValidRevisionSettingsForNumberType Method

Checks whether the revision numbering sequence owns a valid revision settings for number type.

## Syntax (C#)
```csharp
public bool HasValidRevisionSettingsForNumberType()
```

## Returns
True if the revision numbering sequence owns a valid revision settings for number type.